# Importing the libraries and dataset

In [69]:
import pandas as pd

file = pd.read_csv("data/processing.csv")

# Checking the data shape and columns

In [70]:
file.shape

(3979, 16)

In [71]:
file.head()

,id,facility_id,facility_type,year,input,input_value_tonnes,output,output_value_tonnes,grade_ppm,recovery_rate,amount_sold_tonnes,metal_payable_tonnes,incl_purchased,reporting_period,source_id,comment
0,1,COM00005.00,Refinery,2008,"Nepheline ore, Limestone",NaN,Alumina,1069000.0,NaN,NaN,NaN,NaN,NaN,NaN,det_1291,NaN
1,2,COM00005.00,Refinery,2009,"Nepheline ore, Limestone",NaN,Alumina,922000.0,NaN,NaN,NaN,NaN,NaN,NaN,det_1291,NaN
2,3,COM00005.00,Refinery,2010,"Nepheline ore, Limestone",NaN,Alumina,1000000.0,NaN,NaN,NaN,NaN,NaN,NaN,det_2008,NaN
3,4,COM00005.00,Refinery,2011,"Nepheline ore, Limestone",NaN,Alumina,977000.0,NaN,NaN,NaN,NaN,NaN,NaN,det_2008,NaN
4,5,COM00005.00,Refinery,2012,"Nepheline ore, Limestone",NaN,Alumina,945000.0,NaN,NaN,NaN,NaN,NaN,NaN,det_1303,NaN

# Processing the data for the client

In [72]:
# The latest client plans to build a new Limestone processing plant (a refinery) to produce Alumina. So right now it is prospecting competitors.
file = file[(file['output']=='Alumina')&(file['facility_type']=='Refinery')&(file['input']=='Nepheline ore, Limestone')]
print("After filtering the whole datset, we end up with {} entries representing 12 refineries.".format(file.shape[0]))

After filtering the whole datset, we end up with 12 entries representing 12 refineries.

In [73]:
# We will drop columns containing nulls
file = file.dropna(axis=1)

In [74]:
print("We inform our client that there is only one facility_id in the area, identified by the tag '{}'.".format(file['facility_id'].value_counts().index[0]))

We inform our client that there is only one facility_id in the area, identified by the tag 'COM00005.00'.

In [75]:
# Since there is only one facility id and we already know the input, output and facility type, we will drop those too. There is no use for source_id.
file = file[['year', 'output_value_tonnes']]

In [76]:
# The client database is all in pounds, so we should convert our data from tonne (kg) to ton (pounds)
ton_to_tonne_ratio = 1.1
file['output_value_tonnes'] = file['output_value_tonnes'].values*ton_to_tonne_ratio

In [77]:
file

    year  output_value_tonnes
0   2008            1175900.0
1   2009            1014200.0
2   2010            1100000.0
3   2011            1074700.0
4   2012            1039500.0
5   2013            1018600.0
6   2014             980100.0
7   2015             968000.0
8   2016            1007600.0
9   2017            1039500.0
10  2018             936100.0
11  2019             905300.0